<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2014 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------


//这个是自动加载的函数库
//functions那个并不是


/**
 * [cutMoney 截取金额 小数点后有数字显示 没有取整]
 * @param  [string] $m [金额]
 * @return [string]    [处理后的金额]
 */
function cutMoney($m)
{
    $y=explode(".", $m);
    return ($y[1] > 0 ) ? $m : $y[0];
}
